from os import name


def greetings():
    print('Приветствуем Вас, дорогой наш пользователь телефонной книги!')


def menu():
    print('''
    Телефонный справочник предлагает Вам следующие опции:

    Введите цифру от 1 до 6, пожалуйста)

    1. Показать все контакты
    2. Найти контакт
    3. Добавить контакт
    4. Удалить контакт
    5. Редактировать контакт
    6. Закрыть справочник''')


def read_phonebook():
    print('*************************')
    print('Контакты:')
    with open('file.txt', 'r+', encoding='utf-8') as file:
        for line in file:
            print(line)
    print('*************************')
    file.close()


def add_contact():
    print('*************************')
    print(f'Контакт успешно добавлен, спасибо!')
    print('*************************')


def edit_contact():
    print('*************************')
    print(f'Контакт успешно изменён, спасибо!')
    print('*************************')


def delete_contact():
    print('*************************')
    print(f'Контакт успешно удалён, спасибо!')
    print('*************************')
